# tap "homebrew/aliases"
# tap "homebrew/autoupdate"
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/command-not-found"
# tap "homebrew/core"
# tap "homebrew/services"
# tap "homebrew/test-bot"

tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-modern-vscode-icon", "with-native-comp"]
brew "ripgrep"
cask "arc"
brew "starship"

brew "awscli"
brew "direnv"
brew "entr"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "shfmt"
brew "zsh-completions"
cask "eqmac"
# cask "github"
cask "font-fira-code"
cask "docker"
brew "pyenv"
brew "pyenv-virtualenv"
