tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "act"
brew "readline"
brew "awscli"
brew "bash-completion"
brew "bzip2"
brew "glib"
brew "coreutils"
brew "fd"
brew "gawk"
brew "gdk-pixbuf"
brew "gh"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grip"
brew "htop"
brew "httpie"
brew "jq"
brew "libgccjit"
brew "openssl@3"
brew "pandoc"
brew "pip-completion"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "s3cmd"
brew "shellcheck"
brew "shfmt"
brew "swig@3"
brew "texinfo"
brew "zlib"
